In [1]:
import mysql.connector as connection
try:
    mydb=connection.connect(host="localhost",user="root",passwd="mysql")
    cur = mydb.cursor()
    cur.execute("CREATE DATABASE company_details")
    print("database created!!")
    
except Execption as e:
    mydb.close()
    print(str(e))

database created!!

In [2]:
import mysql.connector as connection
try:
    mydb=connection.connect(host="localhost",user="root",passwd="mysql",database="company_details")
    cur = mydb.cursor()
    cur.execute("CREATE TABLE worker (id INT PRIMARY KEY AUTO_INCREMENT,f_name VARCHAR(30),dept VARCHAR(30),salary DECIMAL(7,1),email VARCHAR(30),join_dt DATE)")
    print("table created!!")
    mydb.close()    
except Execption as e:
    mydb.close()
    print(str(e))

table created!!

In [6]:
import mysql.connector as connection
try:
    mydb=connection.connect(host="localhost",user="root",passwd="mysql",database="company_details")
    cur = mydb.cursor()
    cur.execute("INSERT INTO  worker VALUES (NULL,'Vedanti','HR',100000,'veda@mail.com','2018-06-07'),(NULL,'Avanti','Account',120000,'avanti@mail.com','2017-02-08'),(NULL,'Amitabh','Admin',150000,'amitabh@mail.com','2019-06-16'),(NULL,'Vipul','Admin',130000,'vipul121@mail.com','2016-06-07'),(NULL,'Satish','HR',140000,'satish5@mail.com','2018-06-07'),(NULL,'Rahul','Account',110000,'rahul8@mail.com','2019-06-05'),(NULL,'Anvi','HR',145000,'anu@mail.com','2016-03-07'),(NULL,'Savi','Account',123000,'savi@mail.com','2019-01-10'),(NULL,'Akansha','Admin',160000,'akansha@mail.com','2014-08-01'),(NULL,'Alvin','Admin',155000,'alvin@mail.com','2019-03-02')")
    mydb.commit()
    print("data inserted!!")
    mydb.close()    

except Exception as e:
    mydb.close()
    print(str(e))

data inserted!!

### Q-1. Write an SQL query to fetch “FIRST_NAME” from Worker table using the alias name as WORKER_NAME.

In [1]:
import mysql.connector as connection
import pandas as pd
mydb= connection.connect(host ="localhost",user="root",database = "company_details",passwd = "mysql")
pd.read_sql("SELECT f_name AS WORKER_NAME FROM worker ",mydb)

  WORKER_NAME
0     Vedanti
1      Avanti
2     Amitabh
3       Vipul
4      Satish
5       Rahul
6        Anvi
7        Savi
8     Akansha
9       Alvin

### Q-2. Write an SQL query to fetch unique values of DEPARTMENT from Worker table.

In [10]:
import mysql.connector as connection
mydb=connection.connect(host="localhost",user="root",passwd="mysql",database="company_details")
cur = mydb.cursor()
cur.execute("SELECT DISTINCT dept FROM worker")
res = cur.fetchall()
for i in res:
    print(i)

('HR',)
('Account',)
('Admin',)

### Q-3. Write an SQL query to show the last 5 record from a table.

In [11]:
import mysql.connector as connection
mydb=connection.connect(host="localhost",user="root",passwd="mysql",database="company_details")
cur = mydb.cursor()
cur.execute("SELECT * FROM worker LIMIT 5 OFFSET 5") 
res = cur.fetchall()
for i in res:
    print(i)

(6, 'Rahul', 'Account', Decimal('110000.0'), 'rahul8@mail.com', datetime.date(2019, 6, 5))
(7, 'Anvi', 'HR', Decimal('145000.0'), 'anu@mail.com', datetime.date(2016, 3, 7))
(8, 'Savi', 'Account', Decimal('123000.0'), 'savi@mail.com', datetime.date(2019, 1, 10))
(9, 'Akansha', 'Admin', Decimal('160000.0'), 'akansha@mail.com', datetime.date(2014, 8, 1))
(10, 'Alvin', 'Admin', Decimal('155000.0'), 'alvin@mail.com', datetime.date(2019, 3, 2))